// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "今天是2021.3.22",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "姑且叫你一声张子杨姐姐",  // 同上...
        "美丽的子杨姐",
        "性感的身材",
        "很开心",
        "在那个夜晚",
        "能遇见你",
        "这几天与你聊天",
        "真的很开心",
        "真心的祝愿你",
        "今后可以与遇见一个真正爱你的和你爱的人",
        "我不在乎这个人是不是我",
        "我只希望你能一直永远的自信！开心！和幸福！",
        "生日快乐！子杨姐！",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "今天是2021.3.22": "./imgs/h.jpg",
        "姑且叫你一声张子杨姐姐": "./imgs/k.jpg",
        "美丽的子杨姐": "./imgs/shencai.jpg",
        "性感的身材": "./imgs/yao.jpg",
        "很开心": "./imgs/b.jpg",
        "在那个夜晚": "./imgs/f.jpg",
        "能遇见你": "./imgs/e.jpg",
        "这几天与你聊天": "./imgs/l.jpg",
        "真的很开心": "./imgs/i.jpg",
        "真心的祝愿你": "./imgs/n.jpg",
        "今后可以与遇见一个真正爱你的和你爱的人": "./imgs/a.jpg",
        "我不在乎这个人是不是我": "./imgs/m.jpg",
        "我只希望你能一直永远的自信！开心！和幸福！": "./imgs/c.jpg",
        "生日快乐！子杨姐！": "./imgs/g.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
